Revit 2024 API
ExternalServices.BuiltInExternalServices.ForgeSchemaService Property
 Autodesk Internal: The service for interacting with the Forge Schema Service.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ExternalServiceId ForgeSchemaService { get; }
Visual Basic
Public Shared ReadOnly Property ForgeSchemaService As ExternalServiceId
	Get
Visual C++
public:
static property ExternalServiceId^ ForgeSchemaService {
	ExternalServiceId^ get ();
}
See Also
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace